{
	"page": {
		"introSection": {
			"text": "Engenheiro de software qualificado com proficiência em diferentes linguagens e frameworks. Experiente em desenvolvimento full-stack, adepto da resolução de problemas e dedicado a arte de criar código de alta qualidade.",
			"subtitle": "Developer"
		},
		"tech&SkillsSection": {
			"title": "Habilidades"
		},
		"careerTimelineSection": {
			"title": "Carreira",
			"whimtach": {
				"date": "(4 meses)",
				"uxDesigner": {
					"startDate": "Fev 2022",
					"endDate": "Mai 2022",
					"text": "Atuei como UX designer principal na elaboração de um site para uma empresa de cosméticos, criando múltiplos designs de páginas, componentes, e gráficos usando Figma e Photoshop, além de realizar reuniões bissemanais com os stakeholders do projeto para coletar feedback e discutir requerimentos."
				}
			},
			"rbc": {
				"date": "(1 ano)",
				"fullStack": {
					"subtitle": "Developer Full-stack Co-op (Estágio)",
					"startDate": "Mai 2022",
					"endDate": "Ago 2022",
					"text": "Criei um programa em Python, com interface gráfica Tkinter, que usa a biblioteca Pandas para filtrar e gerar um arquivo .CSV de acordo com certos requerimentos. Também desenvolvi uma aplicação web feita em stack MEAN que expande nas funcionalidades do programa em Python, com ferramentas de visualização de dados e coleta automática de informação."
				},
				"frontEnd1": {
					"subtitle": "Developer Front-end Co-op (Estágio)",
					"startDate": "Set 2022",
					"endDate": "Dez 2022",
					"text": "Trabalhei implementando, testando, revisando e entregando componentes Angular como parte da equipe responsável pela biblioteca de componentes front-end principal da empresa."
				},
				"frontEnd2": {
					"subtitle": "Developer Front-end Co-op (Estágio)",
					"startDate": "Mai 2023",
					"endDate": "Ago 2023",
					"text": "Fui convidado novamente a participar da equipe responsável pela biblioteca de componentes principal da empresa, dessa vez implementando, testando, revisando e entregando componentes React. Além disso atuei como um mentor para estudantes do ensino médio participantes do programa “Summer Tech Labs” oferecido pelo RBC, onde os instrui a usar tecnologias web como React e Jest para criar componentes de alta qualidade."
				}
			}
		},
		"educationTimelineSection": {
			"title": "Educação",
			"santaMaria": {
				"subtitle": "Ensino Médio, Brasil",
				"date": "(3 anos)",
				"startDate": "Jan 2017",
				"endDate": "Dez 2019",
				"text": "Ensino médio concluído com sucesso."
			},
			"centennialCollege": {
				"subtitle": "Engenharia de Software, Canada",
				"date": "(3 anos)",
				"startDate": "Jan 2020",
				"endDate": "Dez 2023",
				"text": "Obtive um \"Ontario College Advanced Diploma\" (diploma avançado de faculdade em Ontario) em engenharia de software na Centennial College, onde dominei diversas linguagens de programação, estudei e coloquei em prática metodologias da indústria relacionadas a criação de software em pequena, média e larga escala."
			}
		},
		"projectsSection": {
			"title": "Projetos",
			"serverlessApiFormService": {
				"text": "Criei um serviço de API, com seu próprio portal front-end, que permite usuários a criar/consumir programaticamente unidades genéricas de dados chamadas \"form items\" (itens de formulário) e \"business contacts\" (contatos comerciais)."
			},
			"s3DynamodbVideoplayer": {
				"text": "Programei um site de envio e reprodução de conteúdo audiovisual, que permite usuários enviarem, assistirem, comentarem, e avaliarem vídeos."
			}
		},
		"contactSection": {
			"title": "Contato",
			"text": "Interessado em alguma das minhas habilidades? Envie-me um e-mail ou uma mensagem no LinkedIn! Sou um cara muito simpático, então bate-papos (mesmo virtuais) são mais que bem vindos."
		}
	},
	"navigation": {
		"buttons": {
			"contact": "Contato",
			"projects": "Projetos",
			"education": "Educação",
			"career": "Carreira",
			"tech&Skills": "Habilidades",
			"hamburgerAria": "Toggle mobile"
		}
	},
	"contactButtons": {
		"email": {
			"text": "Copiar email",
			"ariaLabel": "Copiar endereço de email"
		},
		"linkedIn": {
			"text": "Perfil do LinkedIn",
			"ariaLabel": "Perfil do LinkedIn (abre em uma nova aba)"
		},
		"resume": {
			"text": "Currículo",
			"ariaLabel": "Link do currículo (abre em uma nova aba)",
			"link": "https://docs.google.com/document/d/1WW4nyXzlDmPZzZTd7Dmxer9YWhWvFugb8XfgTA7tlkk/edit?usp=sharing"
		}
	},
	"footer": {
		"localeSwitcherHeaderText": "Idioma",
		"linksHeaderText": "Links"
	}
}
